## 📦 Terraform Plan Output

```hcl
module.app.data.archive_file.forward_logs_zip: Reading...
module.app.data.archive_file.lambda_ecr_listener_zip: Reading...
module.app.data.archive_file.lambda_ecr_listener_zip: Read complete after 0s [id=b808981c67a08fb6e4401a517cd171ea749e32ee]
module.app.data.archive_file.forward_logs_zip: Read complete after 0s [id=f776745e62cd8eb36989a0e24d6e7244e5dae794]
module.app.aws_iam_role_policy_attachment.ecs_task_execution_attach: Refreshing state... [id=app1-dev-ecs-execution-role-20250616131713937400000005]
module.app.aws_cloudwatch_log_group.alb_logs: Refreshing state... [id=/alb/access-logs/dev]
module.app.aws_api_gateway_integration.analytics_stats_integration: Refreshing state... [id=agi-2ljtstrllg-vjq56t-GET]
module.app.aws_api_gateway_resource.analytics_stats_resource: Refreshing state... [id=vjq56t]
module.app.aws_security_group.ecs_service: Refreshing state... [id=sg-0baa524a3d20c75b5]
module.app.aws_lambda_permission.allow_api_gateway_invoke_analytics_stats: Refreshing state... [id=AllowExecutionFromAPIGatewayAnalyticsStats]
module.app.aws_ecs_task_definition.app1: Refreshing state... [id=app1-dev-task]
module.app.aws_api_gateway_method.analytics_stats_get_method: Refreshing state... [id=agm-2ljtstrllg-vjq56t-GET]
module.app.aws_ecs_service.app1: Refreshing state... [id=arn:aws:ecs:us-west-2:341795649416:service/app1-dev-cluster/app1-dev-svc]
module.app.aws_lambda_function.analytics_stats_lambda: Refreshing state... [id=analytics-stats-dev]
module.app.aws_ecs_cluster.app1: Refreshing state... [id=arn:aws:ecs:us-west-2:341795649416:cluster/app1-dev-cluster]
module.app.aws_iam_role.ecs_task_execution: Refreshing state... [id=app1-dev-ecs-execution-role]
module.app.aws_iam_role.ec2_role: Refreshing state... [id=ec2-ecr-access-role-dev]
module.app.aws_iam_role.forward_logs_role: Refreshing state... [id=alb-logs-forward-role-dev]
module.app.module.alb.data.aws_partition.current: Reading...
module.app.module.alb.data.aws_partition.current: Read complete after 0s [id=aws]
module.app.aws_sqs_queue.analytics_events: Refreshing state... [id=https://sqs.us-west-2.amazonaws.com/341795649416/analytics-events-queue-dev]
module.app.aws_iam_role.analytics_lambda_role: Refreshing state... [id=analytics-lambda-role-dev]
module.app.aws_cloudwatch_event_rule.ecr_latest_image_push: Refreshing state... [id=ecr-latest-image-push-dev]
module.app.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-051a6ff3a27fe7911]
module.app.aws_api_gateway_rest_api.analytics_api: Refreshing state... [id=2ljtstrllg]
module.app.aws_ecr_repository.ecr: Refreshing state... [id=ecr-kapset-dev]
module.app.aws_iam_role.lambda_restart_role: Refreshing state... [id=lambda-ecr-image-watcher-dev]
module.app.aws_iam_instance_profile.ec2_instance_profile: Refreshing state... [id=ec2-ecr-access-profile-dev]
module.app.aws_iam_role_policy_attachment.ssm_core: Refreshing state... [id=ec2-ecr-access-role-dev-20250616131713109500000001]
module.app.aws_iam_role_policy_attachment.ecr_access: Refreshing state... [id=ec2-ecr-access-role-dev-20250616131713222700000003]
module.app.aws_iam_role_policy.forward_logs_policy: Refreshing state... [id=alb-logs-forward-role-dev:terraform-20250616131713175100000002]
module.app.aws_lambda_function.forward_logs: Refreshing state... [id=forward-alb-logs-dev]
module.app.aws_iam_role_policy.lambda_restart_policy: Refreshing state... [id=lambda-ecr-image-watcher-dev:terraform-20250616131713263200000004]
module.app.aws_lambda_function.ecr_listener: Refreshing state... [id=ecr_image_listener-dev]
module.app.aws_api_gateway_resource.init_analytics_db_resource: Refreshing state... [id=xracm2]
module.app.aws_api_gateway_resource.analytics_resource: Refreshing state... [id=k0c5c2]
module.app.aws_iam_role_policy.analytics_lambda_policy: Refreshing state... [id=analytics-lambda-role-dev:terraform-2025061613173910960000000e]
module.app.aws_api_gateway_method.analytics_post_method: Refreshing state... [id=agm-2ljtstrllg-k0c5c2-POST]
module.app.aws_api_gateway_method.analytics_get_method: Refreshing state... [id=agm-2ljtstrllg-k0c5c2-GET]
module.app.aws_api_gateway_method.init_analytics_db_post_method: Refreshing state... [id=agm-2ljtstrllg-xracm2-POST]
module.app.aws_lambda_permission.allow_s3_trigger: Refreshing state... [id=AllowExecutionFromS3]
module.app.aws_ecr_lifecycle_policy.ecr_policy: Refreshing state... [id=ecr-kapset-dev]
module.app.aws_lambda_permission.eventbridge_invoke_lambda: Refreshing state... [id=AllowExecutionFromEventBridge_ECRPush]
module.app.aws_cloudwatch_event_target.trigger_lambda_on_image_push: Refreshing state... [id=ecr-latest-image-push-dev-ECRImagePushTarget]
module.app.aws_s3_bucket_notification.alb_logs_to_lambda: Refreshing state... [id=alb-access-logs-storage-for-mamkindevops-dev-1]
module.app.aws_security_group.lambda_db_sg: Refreshing state... [id=sg-0553e60227b151b3e]
module.app.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0ce759ed0f9fcac0a]
module.app.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-052506f572f351e4c]
module.app.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0feeb9c4b2107880d]
module.app.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-09013115daf32a0c4]
module.app.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-01c2bedb8d3c9d6af]
module.app.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-03c90cf349cacee2e]
module.app.module.alb.aws_lb_target_group.this["app"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:341795649416:targetgroup/app1-d20250617074050620100000001/80dc4bc04626b9b6]
module.app.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0ce4940a474ab969e]
module.app.module.alb.aws_security_group.this[0]: Refreshing state... [id=sg-05336ee7cbc17d313]
module.app.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0e633e4df68f87fb9]
module.app.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0d8b22abcdc3930e7]
module.app.aws_security_group.rds_sg: Refreshing state... [id=sg-0d31658d7c5c54c1b]
module.app.module.alb.aws_vpc_security_group_egress_rule.this["all"]: Refreshing state... [id=sgr-09c5ca889b0593c40]
module.app.module.alb.aws_vpc_security_group_ingress_rule.this["http"]: Refreshing state... [id=sgr-0e13bb3305166bb41]
module.app.aws_security_group.app_sg: Refreshing state... [id=sg-0189aab73403149f7]
module.app.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-05efaed463228e6ea]
module.app.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0c42d8858983d234b]
module.app.module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:341795649416:loadbalancer/app/app1-alb-dev/c418655df08693b1]
module.app.aws_db_subnet_group.analytics_rds_subnet_group: Refreshing state... [id=analytics-rds-subnet-group-dev]
module.app.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-06e9faecb9d9bd30b]
module.app.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0f8a5234e1ce65339]
module.app.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0e633e4df68f87fb91080289494]
module.app.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0cb3ef70ff04664d6]
module.app.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-09bd8f9508fd3e19c]
module.app.module.alb.aws_lb_listener.this["http"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:341795649416:listener/app/app1-alb-dev/c418655df08693b1/a437f6a064524e34]
module.app.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0ce4940a474ab969e1080289494]
module.app.aws_db_instance.analytics_db: Refreshing state... [id=db-LSTKLV3UU5KYH7AHSJNAV4SKXA]
module.app.aws_lambda_function.analytics_db_init_lambda: Refreshing state... [id=analytics-db-init-dev]
module.app.aws_lambda_function.analytics_data_getter_lambda: Refreshing state... [id=analytics-data-getter-dev]
module.app.aws_lambda_function.analytics_sqs_consumer_lambda: Refreshing state... [id=analytics-sqs-consumer-dev]
module.app.aws_lambda_function.analytics_lambda: Refreshing state... [id=analytics-event-handler-dev]
module.app.aws_lambda_event_source_mapping.analytics_sqs_trigger: Refreshing state... [id=183bf209-f900-4149-b90b-bb3b641af205]
module.app.aws_lambda_permission.allow_api_gateway_invoke_analytics_get: Refreshing state... [id=AllowExecutionFromAPIGatewayAnalyticsGet]
module.app.aws_api_gateway_integration.analytics_get_integration: Refreshing state... [id=agi-2ljtstrllg-k0c5c2-GET]
module.app.aws_lambda_permission.allow_api_gateway_invoke_init_analytics_db: Refreshing state... [id=AllowExecutionFromAPIGatewayInitAnalyticsDb]
module.app.aws_api_gateway_integration.init_analytics_db_integration: Refreshing state... [id=agi-2ljtstrllg-xracm2-POST]
module.app.aws_lambda_permission.allow_api_gateway_invoke: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.app.aws_api_gateway_integration.analytics_integration: Refreshing state... [id=agi-2ljtstrllg-k0c5c2-POST]
module.app.aws_api_gateway_deployment.analytics_api_deployment: Refreshing state... [id=gu1ku3]
module.app.aws_api_gateway_stage.analytics_api_stage: Refreshing state... [id=ags-2ljtstrllg-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.app.aws_api_gateway_integration.analytics_stats_integration will be destroyed
  # (because aws_api_gateway_integration.analytics_stats_integration is not in configuration)
  - resource "aws_api_gateway_integration" "analytics_stats_integration" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "vjq56t" -> null
      - connection_type         = "INTERNET" -> null
      - http_method             = "GET" -> null
      - id                      = "agi-2ljtstrllg-vjq56t-GET" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      - resource_id             = "vjq56t" -> null
      - rest_api_id             = "2ljtstrllg" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS_PROXY" -> null
      - uri                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:341795649416:function:analytics-stats-dev/invocations" -> null
        # (3 unchanged attributes hidden)
    }

  # module.app.aws_api_gateway_method.analytics_stats_get_method will be destroyed
  # (because aws_api_gateway_method.analytics_stats_get_method is not in configuration)
  - resource "aws_api_gateway_method" "analytics_stats_get_method" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "GET" -> null
      - id                   = "agm-2ljtstrllg-vjq56t-GET" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "vjq56t" -> null
      - rest_api_id          = "2ljtstrllg" -> null
        # (3 unchanged attributes hidden)
    }

  # module.app.aws_api_gateway_resource.analytics_stats_resource will be destroyed
  # (because aws_api_gateway_resource.analytics_stats_resource is not in configuration)
  - resource "aws_api_gateway_resource" "analytics_stats_resource" {
      - id          = "vjq56t" -> null
      - parent_id   = "x06ln8pyn2" -> null
      - path        = "/analytics-stats" -> null
      - path_part   = "analytics-stats" -> null
      - rest_api_id = "2ljtstrllg" -> null
    }

  # module.app.aws_autoscaling_group.app1_asg will be created
  + resource "aws_autoscaling_group" "app1_asg" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = 1
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 300
      + health_check_type                = "EC2"
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_size                         = 3
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = "app1-asg-dev"
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = [
          + "subnet-01c2bedb8d3c9d6af",
          + "subnet-09013115daf32a0c4",
        ]
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + availability_zone_distribution (known after apply)

      + capacity_reservation_specification (known after apply)

      + instance_refresh {
          + strategy = "Rolling"

          + preferences {
              + checkpoint_delay             = "0"
              + checkpoint_percentages       = [
                  + 100,
                ]
              + max_healthy_percentage       = 100
              + min_healthy_percentage       = 100
              + scale_in_protected_instances = "Ignore"
              + skip_matching                = false
              + standby_instances            = "Ignore"
            }
        }

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + mixed_instances_policy (known after apply)

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "app1-asg-instance-dev"
        }

      + traffic_source (known after apply)
    }

  # module.app.aws_autoscaling_policy.scale_in will be created
  + resource "aws_autoscaling_policy" "scale_in" {
      + adjustment_type         = "ChangeInCapacity"
      + arn                     = (known after apply)
      + autoscaling_group_name  = "app1-asg-dev"
      + cooldown                = 300
      + enabled                 = true
      + id                      = (known after apply)
      + metric_aggregation_type = (known after apply)
      + name                    = "cpu-scale-in"
      + policy_type             = "SimpleScaling"
      + scaling_adjustment      = -1
    }

  # module.app.aws_autoscaling_policy.scale_out will be created
  + resource "aws_autoscaling_policy" "scale_out" {
      + adjustment_type         = "ChangeInCapacity"
      + arn                     = (known after apply)
      + autoscaling_group_name  = "app1-asg-dev"
      + cooldown                = 300
      + enabled                 = true
      + id                      = (known after apply)
      + metric_aggregation_type = (known after apply)
      + name                    = "cpu-scale-out"
      + policy_type             = "SimpleScaling"
      + scaling_adjustment      = 1
    }

  # module.app.aws_cloudwatch_metric_alarm.cpu_high will be created
  + resource "aws_cloudwatch_metric_alarm" "cpu_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Scale out if CPU > 14%"
      + alarm_name                            = "cpu-high"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "AutoScalingGroupName" = "app1-asg-dev"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/EC2"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 14
      + treat_missing_data                    = "missing"
    }

  # module.app.aws_cloudwatch_metric_alarm.cpu_low will be created
  + resource "aws_cloudwatch_metric_alarm" "cpu_low" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Scale in if CPU < 11%"
      + alarm_name                            = "cpu-low"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "AutoScalingGroupName" = "app1-asg-dev"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/EC2"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 11
      + treat_missing_data                    = "missing"
    }

  # module.app.aws_ecs_cluster.app1 will be destroyed
  # (because aws_ecs_cluster.app1 is not in configuration)
  - resource "aws_ecs_cluster" "app1" {
      - arn      = "arn:aws:ecs:us-west-2:341795649416:cluster/app1-dev-cluster" -> null
      - id       = "arn:aws:ecs:us-west-2:341795649416:cluster/app1-dev-cluster" -> null
      - name     = "app1-dev-cluster" -> null
      - tags     = {} -> null
      - tags_all = {} -> null

      - setting {
          - name  = "containerInsights" -> null
          - value = "disabled" -> null
        }
    }

  # module.app.aws_ecs_service.app1 will be destroyed
  # (because aws_ecs_service.app1 is not in configuration)
  - resource "aws_ecs_service" "app1" {
      - availability_zone_rebalancing      = "DISABLED" -> null
      - cluster                            = "arn:aws:ecs:us-west-2:341795649416:cluster/app1-dev-cluster" -> null
      - deployment_maximum_percent         = 200 -> null
      - deployment_minimum_healthy_percent = 100 -> null
      - desired_count                      = 1 -> null
      - enable_ecs_managed_tags            = false -> null
      - enable_execute_command             = false -> null
      - health_check_grace_period_seconds  = 0 -> null
      - iam_role                           = "/aws-service-role/ecs.amazonaws.com/AWSServiceRoleForECS" -> null
      - id                                 = "arn:aws:ecs:us-west-2:341795649416:service/app1-dev-cluster/app1-dev-svc" -> null
      - launch_type                        = "FARGATE" -> null
      - name                               = "app1-dev-svc" -> null
      - platform_version                   = "LATEST" -> null
      - propagate_tags                     = "NONE" -> null
      - scheduling_strategy                = "REPLICA" -> null
      - tags                               = {} -> null
      - tags_all                           = {} -> null
      - task_definition                    = "arn:aws:ecs:us-west-2:341795649416:task-definition/app1-dev-task:2" -> null
      - triggers                           = {} -> null
      - wait_for_steady_state              = false -> null

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }

      - deployment_controller {
          - type = "ECS" -> null
        }

      - load_balancer {
          - container_name   = "app1" -> null
          - container_port   = 8000 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:us-west-2:341795649416:targetgroup/app1-d20250617074050620100000001/80dc4bc04626b9b6" -> null
            # (1 unchanged attribute hidden)
        }

      - network_configuration {
          - assign_public_ip = false -> null
          - security_groups  = [
              - "sg-0baa524a3d20c75b5",
            ] -> null
          - subnets          = [
              - "subnet-01c2bedb8d3c9d6af",
              - "subnet-09013115daf32a0c4",
            ] -> null
        }
    }

  # module.app.aws_ecs_task_definition.app1 will be destroyed
  # (because aws_ecs_task_definition.app1 is not in configuration)
  - resource "aws_ecs_task_definition" "app1" {
      - arn                      = "arn:aws:ecs:us-west-2:341795649416:task-definition/app1-dev-task:2" -> null
      - arn_without_revision     = "arn:aws:ecs:us-west-2:341795649416:task-definition/app1-dev-task" -> null
      - container_definitions    = jsonencode(
            [
              - {
                  - environment    = [
                      - {
                          - name  = "ANALYTICS_STATS_URL"
                          - value = "http://2ljtstrllg.execute-api.us-west-2.amazonaws.com/dev/analytics-stats"
                        },
                      - {
                          - name  = "ENV"
                          - value = "dev"
                        },
                    ]
                  - essential      = true
                  - image          = "341795649416.dkr.ecr.us-west-2.amazonaws.com/ecr-kapset-dev:dev-latest"
                  - mountPoints    = []
                  - name           = "app1"
                  - portMappings   = [
                      - {
                          - containerPort = 8000
                          - hostPort      = 8000
                          - protocol      = "tcp"
                        },
                    ]
                  - systemControls = []
                  - volumesFrom    = []
                },
            ]
        ) -> null
      - cpu                      = "256" -> null
      - enable_fault_injection   = false -> null
      - execution_role_arn       = "arn:aws:iam::341795649416:role/app1-dev-ecs-execution-role" -> null
      - family                   = "app1-dev-task" -> null
      - id                       = "app1-dev-task" -> null
      - memory                   = "512" -> null
      - network_mode             = "awsvpc" -> null
      - requires_compatibilities = [
          - "FARGATE",
        ] -> null
      - revision                 = 2 -> null
      - skip_destroy             = false -> null
      - tags                     = {} -> null
      - tags_all                 = {} -> null
      - track_latest             = false -> null
        # (3 unchanged attributes hidden)
    }

  # module.app.aws_iam_role.ecs_task_execution will be destroyed
  # (because aws_iam_role.ecs_task_execution is not in configuration)
  - resource "aws_iam_role" "ecs_task_execution" {
      - arn                   = "arn:aws:iam::341795649416:role/app1-dev-ecs-execution-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-06-16T13:17:12Z" -> null
      - force_detach_policies = false -> null
      - id                    = "app1-dev-ecs-execution-role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "app1-dev-ecs-execution-role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAU7FE3W6EBCPKAN3JT" -> null
        # (3 unchanged attributes hidden)
    }

  # module.app.aws_iam_role_policy_attachment.ecs_task_execution_attach will be destroyed
  # (because aws_iam_role_policy_attachment.ecs_task_execution_attach is not in configuration)
  - resource "aws_iam_role_policy_attachment" "ecs_task_execution_attach" {
      - id         = "app1-dev-ecs-execution-role-20250616131713937400000005" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy" -> null
      - role       = "app1-dev-ecs-execution-role" -> null
    }

  # module.app.aws_lambda_function.analytics_stats_lambda will be destroyed
  # (because aws_lambda_function.analytics_stats_lambda is not in configuration)
  - resource "aws_lambda_function" "analytics_stats_lambda" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:us-west-2:341795649416:function:analytics-stats-dev" -> null
      - code_sha256                    = "WdaQZGm7mm/TMdVv21Mo29mfNhhSMsHD/4KmTsQiX0A=" -> null
      - function_name                  = "analytics-stats-dev" -> null
      - handler                        = "index.handler" -> null
      - id                             = "analytics-stats-dev" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:341795649416:function:analytics-stats-dev/invocations" -> null
      - last_modified                  = "2025-06-17T08:41:27.000+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 512 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-west-2:341795649416:function:analytics-stats-dev:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:341795649416:function:analytics-stats-dev:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::341795649416:role/analytics-lambda-role-dev" -> null
      - runtime                        = "nodejs20.x" -> null
      - s3_bucket                      = "tfstate-storage-for-mamkindevops-dev-1" -> null
      - s3_key                         = "lambda/placeholders/placeholder.zip" -> null
      - skip_destroy                   = false -> null
      - source_code_size               = 167782 -> null
      - tags                           = {
          - "Environment" = "dev"
          - "Name"        = "analytics-stats-dev"
        } -> null
      - tags_all                       = {
          - "Environment" = "dev"
          - "Name"        = "analytics-stats-dev"
        } -> null
      - timeout                        = 30 -> null
      - version                        = "$LATEST" -> null
        # (7 unchanged attributes hidden)

      - environment {
          - variables = {
              - "DB_HOST"     = "analytics-db-dev.chasaoa2syyy.us-west-2.rds.amazonaws.com"
              - "DB_NAME"     = "analyticsdbdev"
              - "DB_PASSWORD" = (sensitive value)
              - "DB_USER"     = "analyticsdb_user"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/analytics-stats-dev" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }

      - vpc_config {
          - ipv6_allowed_for_dual_stack = false -> null
          - security_group_ids          = [
              - "sg-0553e60227b151b3e",
            ] -> null
          - subnet_ids                  = [
              - "subnet-01c2bedb8d3c9d6af",
              - "subnet-09013115daf32a0c4",
            ] -> null
          - vpc_id                      = "vpc-051a6ff3a27fe7911" -> null
        }
    }

  # module.app.aws_lambda_function.ecr_listener will be updated in-place
  ~ resource "aws_lambda_function" "ecr_listener" {
        id                             = "ecr_image_listener-dev"
      ~ last_modified                  = "2025-06-16T13:17:21.582+0000" -> (known after apply)
      ~ source_code_hash               = "GeBOakTF1jdomXuUWwybz/5eBju8g9gi8HuKWtelEYk=" -> "/1nKvmY2BboGWY0C6eM5wGsmKVW8sMR9l1baGaLXg50="
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.app.aws_lambda_function.forward_logs will be updated in-place
  ~ resource "aws_lambda_function" "forward_logs" {
        id                             = "forward-alb-logs-dev"
      ~ last_modified                  = "2025-06-16T13:17:29.644+0000" -> (known after apply)
      ~ source_code_hash               = "e/9kEQ2aIg30XkqbAXRnI9S+sWLgWEm4EXdkjhV77nA=" -> "Oif2u2Ly6lnYUNeeAD8QVDVb5trc0MqSIFU7LEJvn14="
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.app.aws_lambda_permission.allow_api_gateway_invoke_analytics_stats will be destroyed
  # (because aws_lambda_permission.allow_api_gateway_invoke_analytics_stats is not in configuration)
  - resource "aws_lambda_permission" "allow_api_gateway_invoke_analytics_stats" {
      - action              = "lambda:InvokeFunction" -> null
      - function_name       = "analytics-stats-dev" -> null
      - id                  = "AllowExecutionFromAPIGatewayAnalyticsStats" -> null
      - principal           = "apigateway.amazonaws.com" -> null
      - source_arn          = "arn:aws:execute-api:us-west-2:341795649416:2ljtstrllg/*/*" -> null
      - statement_id        = "AllowExecutionFromAPIGatewayAnalyticsStats" -> null
        # (2 unchanged attributes hidden)
    }

  # module.app.aws_launch_template.app_server will be created
  + resource "aws_launch_template" "app_server" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-075686beab831bb7f"
      + instance_type          = "t3.micro"
      + key_name               = "devops_practice"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "app1-launch-template-dev"
      + tags_all               = (known after apply)
      + user_data              = "IyEvYmluL2Jhc2gKCiMgLS0tLS0tLS0tLS0tLS0tLS0tLS0tLS0tLS0tLS0tLS0tLS0tLS0tLS0tLS0tLS0tLS0tLS0tLS0tLS0tLS0tLS0tLS0tLS0tLS0tLS0KIyBFQzIgYm9vdHN0cmFwIHNjcmlwdCBmb3IgYXV0b25vbW91cyBwcm92aXNpb25pbmcgb2YgYXBwMSBjb250YWluZXIKIwojIFJlc3BvbnNpYmlsaXRpZXM6CiMgLSBEaXNhYmxlcyBJUHY2IHRvIGVuc3VyZSBjb21wYXRpYmlsaXR5IHdpdGggSVB2NC1vbmx5IE5BVCBHYXRld2F5CiMgLSBGb3JjZXMgSVB2NCBETlMgcmVzb2x1dGlvbiBwcmlvcml0eSB0byBhdm9pZCBicm9rZW4gSVB2NiBjb25uZWN0aW9ucwojIC0gSW5zdGFsbHMgRG9ja2VyIChvZmZpY2lhbCBtZXRob2QpIGFuZCBBV1MgQ0xJIHYyCiMgLSBMb2dzIGluIHRvIEFtYXpvbiBFQ1IgdXNpbmcgSUFNIGluc3RhbmNlIHJvbGUKIyAtIFB1bGxzIGFuZCBydW5zIHRoZSBsYXRlc3QgdmVyc2lvbiBvZiB0aGUgYXBwMSBjb250YWluZXIKIwojIE91dHB1dDoKIyAtIEV4ZWN1dGlvbiBsb2cgd3JpdHRlbiB0byAvdmFyL2xvZy91c2VyX2RhdGEuYm9vdHN0cmFwLmxvZwojIC0tLS0tLS0tLS0tLS0tLS0tLS0tLS0tLS0tLS0tLS0tLS0tLS0tLS0tLS0tLS0tLS0tLS0tLS0tLS0tLS0tLS0tLS0tLS0tLS0tLS0tCgooCmVjaG8gIj09PT09IFNUQVJUIEZVTEwgQk9PVFNUUkFQID09PT09IgpkYXRlCgojIENvbXBsZXRlbHkgZGlzYWJsZSBJUHY2IGF0IHRoZSBrZXJuZWwgbGV2ZWwgdG8gcHJldmVudCBhbnkgYXR0ZW1wdHMgdG8gdXNlIElQdjYgYWRkcmVzc2VzIGZvciBvdXRib3VuZCBjb25uZWN0aW9ucywKIyBzaW5jZSBOQVQgR2F0ZXdheSBpbiB0aGlzIHNldHVwIHN1cHBvcnRzIG9ubHkgSVB2NC4gVGhpcyBoZWxwcyBhdm9pZCBmYWlsdXJlcyBpbiBhcHQsIGN1cmwsIGRvY2tlciwgYW5kIGF3cyBDTEkKIyBjYXVzZWQgYnkgdGhlIHN5c3RlbSBwcmVmZXJyaW5nIHVucmVhY2hhYmxlIElQdjYgcm91dGVzLgpzeXNjdGwgLXcgbmV0LmlwdjYuY29uZi5hbGwuZGlzYWJsZV9pcHY2PTEKc3lzY3RsIC13IG5ldC5pcHY2LmNvbmYuZGVmYXVsdC5kaXNhYmxlX2lwdjY9MQplY2hvICJuZXQuaXB2Ni5jb25mLmFsbC5kaXNhYmxlX2lwdjYgPSAxIiA+PiAvZXRjL3N5c2N0bC5jb25mCmVjaG8gIm5ldC5pcHY2LmNvbmYuZGVmYXVsdC5kaXNhYmxlX2lwdjYgPSAxIiA+PiAvZXRjL3N5c2N0bC5jb25mCgojIEZvcmNlIElQdjQgdG8gYmUgcHJlZmVycmVkIG92ZXIgSVB2NiBpbiBuYW1lIHJlc29sdXRpb24gYnkgdXBkYXRpbmcgL2V0Yy9nYWkuY29uZi4KIyBUaGlzIGVuc3VyZXMgdGhhdCBETlMgbG9va3VwcyAoZ2V0YWRkcmluZm8pIHJldHVybiBJUHY0IGFkZHJlc3NlcyBmaXJzdCwgZXZlbiBpZiBJUHY2IGlzIGF2YWlsYWJsZSwKIyBhdm9pZGluZyBicm9rZW4gY29ubmVjdGl2aXR5IGluIGVudmlyb25tZW50cyB3aXRob3V0IElQdjYgcm91dGluZyBzdXBwb3J0IChsaWtlIEVDMiB3aXRoIE5BVCBvbmx5KS4KZWNobyAncHJlY2VkZW5jZSA6OmZmZmY6MDowLzk2ICAxMDAnID4+IC9ldGMvZ2FpLmNvbmYKCiMgVXBkYXRlIHBhY2thZ2UgbGlzdCBhbmQgaW5zdGFsbCBkZXBlbmRlbmNpZXMKYXB0LWdldCB1cGRhdGUgLXkKYXB0LWdldCBpbnN0YWxsIC15IFwKICBjYS1jZXJ0aWZpY2F0ZXMgXAogIGN1cmwgXAogIGdudXBnIFwKICBsc2ItcmVsZWFzZSBcCiAgdW56aXAKCiMgSW5zdGFsbCBEb2NrZXIgdXNpbmcgdGhlIG9mZmljaWFsIG1ldGhvZAppbnN0YWxsIC1tIDA3NTUgLWQgL2V0Yy9hcHQva2V5cmluZ3MKY3VybCAtZnNTTCBodHRwczovL2Rvd25sb2FkLmRvY2tlci5jb20vbGludXgvdWJ1bnR1L2dwZyB8IFwKICBncGcgLS1kZWFybW9yIC1vIC9ldGMvYXB0L2tleXJpbmdzL2RvY2tlci5ncGcKCmVjaG8gXAogICJkZWIgW2FyY2g9JChkcGtnIC0tcHJpbnQtYXJjaGl0ZWN0dXJlKSBzaWduZWQtYnk9L2V0Yy9hcHQva2V5cmluZ3MvZG9ja2VyLmdwZ10gXAogIGh0dHBzOi8vZG93bmxvYWQuZG9ja2VyLmNvbS9saW51eC91YnVudHUgJChsc2JfcmVsZWFzZSAtY3MpIHN0YWJsZSIgXAogID4gL2V0Yy9hcHQvc291cmNlcy5saXN0LmQvZG9ja2VyLmxpc3QKCmFwdC1nZXQgdXBkYXRlIC15CmFwdC1nZXQgaW5zdGFsbCAteSBkb2NrZXItY2UgZG9ja2VyLWNlLWNsaSBjb250YWluZXJkLmlvIGRvY2tlci1idWlsZHgtcGx1Z2luIGRvY2tlci1jb21wb3NlLXBsdWdpbgoKc3lzdGVtY3RsIGVuYWJsZSBkb2NrZXIKc3lzdGVtY3RsIHN0YXJ0IGRvY2tlcgoKZWNobyAi4pyFIERvY2tlciBpbnN0YWxsZWQ6ICQoZG9ja2VyIC0tdmVyc2lvbikiCgojIEluc3RhbGwgQVdTIENMSSB2MgpjdXJsICJodHRwczovL2F3c2NsaS5hbWF6b25hd3MuY29tL2F3c2NsaS1leGUtbGludXgteDg2XzY0LnppcCIgLW8gImF3c2NsaXYyLnppcCIKdW56aXAgLW8gYXdzY2xpdjIuemlwCi4vYXdzL2luc3RhbGwKZXhwb3J0IFBBVEg9JFBBVEg6L3Vzci9sb2NhbC9iaW4KCmVjaG8gIuKchSBBV1MgQ0xJIGluc3RhbGxlZDogJChhd3MgLS12ZXJzaW9uKSIKCiMgUHVsbCBhbmQgcnVuIGNvbnRhaW5lciBmcm9tIEVDUgpBQ0NPVU5UX0lEPSQoYXdzIHN0cyBnZXQtY2FsbGVyLWlkZW50aXR5IC0tcXVlcnkgQWNjb3VudCAtLW91dHB1dCB0ZXh0KQpSRUdJT049InVzLXdlc3QtMiIKUkVQTz0iZWNyLWthcHNldCIKSU1BR0U9IiRBQ0NPVU5UX0lELmRrci5lY3IuJFJFR0lPTi5hbWF6b25hd3MuY29tLyRSRVBPOmxhdGVzdCIKCmF3cyBlY3IgZ2V0LWxvZ2luLXBhc3N3b3JkIC0tcmVnaW9uICRSRUdJT04gfCBkb2NrZXIgbG9naW4gLS11c2VybmFtZSBBV1MgLS1wYXNzd29yZC1zdGRpbiAkQUNDT1VOVF9JRC5ka3IuZWNyLiRSRUdJT04uYW1hem9uYXdzLmNvbQoKZG9ja2VyIHJtIC1mIGFwcDEgfHwgdHJ1ZQpkb2NrZXIgcHVsbCAkSU1BR0UKZG9ja2VyIHJ1biAtZCAtLW5hbWUgYXBwMSAtcCA4MDo4MDAwICRJTUFHRQoKZWNobyAiPT09PT0gRE9ORSBGVUxMIEJPT1RTVFJBUCA9PT09PSIKKSA+IC92YXIvbG9nL3VzZXJfZGF0YS5ib290c3RyYXAubG9nIDI+JjEK"
      + vpc_security_group_ids = [
          + "sg-0189aab73403149f7",
        ]

      + iam_instance_profile {
          + name = "ec2-ecr-access-profile-dev"
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
          + instance_metadata_tags      = (known after apply)
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name" = "app1-asg-instance-dev"
            }
        }
    }

  # module.app.aws_security_group.ecs_service will be destroyed
  # (because aws_security_group.ecs_service is not in configuration)
  - resource "aws_security_group" "ecs_service" {
      - arn                    = "arn:aws:ec2:us-west-2:341795649416:security-group/sg-0baa524a3d20c75b5" -> null
      - description            = "Allow ALB to reach ECS containers" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - id                     = "sg-0baa524a3d20c75b5" -> null
      - ingress                = [
          - {
              - cidr_blocks      = []
              - from_port        = 8000
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-05336ee7cbc17d313",
                ]
              - self             = false
              - to_port          = 8000
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - name                   = "app1-dev-ecs-sg" -> null
      - owner_id               = "341795649416" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - vpc_id                 = "vpc-051a6ff3a27fe7911" -> null
        # (1 unchanged attribute hidden)
    }

  # module.app.module.alb.aws_lb_listener.this["http"] will be updated in-place
  ~ resource "aws_lb_listener" "this" {
        id                                                                  = "arn:aws:elasticloadbalancing:us-west-2:341795649416:listener/app/app1-alb-dev/c418655df08693b1/a437f6a064524e34"
        tags                                                                = {
            "Environment"           = "dev"
            "Project"               = "app1-dev"
            "terraform-aws-modules" = "alb"
        }
        # (17 unchanged attributes hidden)

      ~ default_action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:us-west-2:341795649416:targetgroup/app1-d20250617074050620100000001/80dc4bc04626b9b6" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.app.module.alb.aws_lb_target_group.this["app"] must be replaced
+/- resource "aws_lb_target_group" "this" {
      ~ arn                                = "arn:aws:elasticloadbalancing:us-west-2:341795649416:targetgroup/app1-d20250617074050620100000001/80dc4bc04626b9b6" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/app1-d20250617074050620100000001/80dc4bc04626b9b6" -> (known after apply)
      + connection_termination             = (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:us-west-2:341795649416:targetgroup/app1-d20250617074050620100000001/80dc4bc04626b9b6" -> (known after apply)
      ~ ip_address_type                    = "ipv4" -> (known after apply)
      ~ load_balancer_arns                 = [
          - "arn:aws:elasticloadbalancing:us-west-2:341795649416:loadbalancer/app/app1-alb-dev/c418655df08693b1",
        ] -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
      ~ load_balancing_anomaly_mitigation  = "off" -> (known after apply)
      ~ load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> (known after apply)
      ~ name                               = "app1-d20250617074050620100000001" -> (known after apply)
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
        tags                               = {
            "Environment"           = "dev"
            "Project"               = "app1-dev"
            "terraform-aws-modules" = "alb"
        }
      ~ target_type                        = "ip" -> "instance" # forces replacement
        # (9 unchanged attributes hidden)

      ~ health_check (known after apply)
      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 5 -> null
          - interval            = 30 -> null
          - matcher             = "200" -> null
          - path                = "/" -> null
          - port                = "traffic-port" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 5 -> null
          - unhealthy_threshold = 2 -> null
        }

      ~ stickiness (known after apply)
      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
            # (1 unchanged attribute hidden)
        }

      ~ target_failover (known after apply)
      - target_failover {}

      ~ target_group_health (known after apply)
      - target_group_health {
          - dns_failover {
              - minimum_healthy_targets_count      = "1" -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
          - unhealthy_state_routing {
              - minimum_healthy_targets_count      = 1 -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
        }

      ~ target_health_state (known after apply)
      - target_health_state {}
    }

Plan: 7 to add, 3 to change, 12 to destroy.

Changes to Outputs:
  - analytics_stats_api_url   = "https://2ljtstrllg.execute-api.us-west-2.amazonaws.com/dev/analytics-stats" -> null

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```